const langData = {
    "en": {
        "home": "Home",
        "about": "About Us",
        "services": "Services",
        "contact": "Contact",
        "products": "Products",
        "projects": "Биз ҳизмат кўрсатган компаниялар",
        "": "",
        "what_we_title": "Why with our cranes?",
        "": "",
        "": "",
        "": "",
        "about_text": "“Sekwang Company” prides itself in being one of the world's leading creative challengers through steady technological development and cost reduction, as well as possessing the highest level of global competitiveness for its products. We think from the standpoint of the customer: “Toward customer’s endless needs\" This is our policy that is “Be Recognized by Customers as Their Best Supplier!\”\
        \
        We are committed to creating happiness through drastic changes and new challenges, and providing you, personally, with more advanced services.\
        \
        We always appreciate your support and wish you the best of luck. Thank you.",
        
        "location": "Toshkent sh. Ohongaron yo'li",
        "job_time": "Monday - Friday 9:00 - 18:00\
        Saturday, Sunday off",
        "powered_by": "©  2023 Powered by",
        "job_time_title": "Working time",
        "social_title": "Social network pages",

        "more": "more...",
        "we_service_company_title": "Биз хизмат кўрсатган компаниялар",
        "lead_form_title1": "Leave us your number and we will be sure to contact you",
        "lead_form_title2": "Ҳозироқ бизга мурожаат қилинг ва бизнесингиздаги муаммоларни биргаликда ҳал қиламиз!",
        "consultation_send_button": "send",
        "telegram_message_modal_text": "Request sent successfully!",
        
        "we_result_title": "Бизнинг натижаларимиз рақамларда:",
        "result_card_text1": "Skilled technical manpower",
        "result_card_text2": "Continuous Improvement",
        "result_card_text3": "Customer satisfaction",
        "result_card_text4": "Perfect for safety work",
        "result_card_text5": "Strong Durability",
        "result_card_text6": "Safety Devices",
        "result_card_text7": "Easy Operating Device",
        "result_card_text8": "Excellent lifting capacity",
        "we_service_company_title": "Биз хизмат кўрсатган компаниялар",
        "what_we_title": "Why with our cranes?",
        
        "companys_thought_title": "Мижозларимиз биз ҳақимизда билдирган фикрлари",
        "company_name1": "ЗАМИН ҚУРИЛИШ cонстуcтион компанияси",
        "company_name2": "Ореҳовий сад",
        "company_name3": "ВЕРО строй маркет",
        "company_name4": "Виртус Триcот",
        "company_video_text": "Ассалому алайкум, бизнинг маркетинг ҳамкоримиз бўлган Бригҳт Медиа томонидан ўтказилган тренинг дарсларидан сўнг бизнинг сотув менеджерларимиз юқори натижалар кўрсотмоқда. Бунинг учун ўз миннатдорчилигимизни билдирамиз ва ўйлаймизки бундан кейинги ҳамкорлигимиз ҳам бундан яхши натижалар кўрсатади.",
        "company_video_text2": "Ассалому алайкум, сиз билан ореҳовий сад. Ореховий сад компанияси Бигҳт Медиа билан ҳамкорликни бошлади. Бизнинг компания Бригҳт Медиа билан ҳамкорлик қилишидан жуда мамнун. Чунки ҳамкорлигимиз бундан ҳам юқори чўққиларга чиқишига ишонамиз. Бригҳт Медиага раҳмат. Натижа жуда зўр.",
        "company_video_text3": "Ассалому алайкум, менинг исмим Ботр мен Веро Строй Маркет компаниясининг менеджери бўлиб ишлайман. Компаниямиз 2006-йилдан бери ўз фаолиятини юритиб келмоқда. Биз ҳозирги кунда Бригҳт Cонсултинг компанияси билан ҳамкорликда ишлаб келмоқдамиз. Ҳозирги кунгача компания бизга курс-cентер шакллантириб уни ривожлантиришда, CЖМ тузишда ва маркетинг стратегиясини ишлаб чиқишда, янги компанияларни жалб қилиб беришди. Шу сабабли сотувимизда сезиларли даражада ўзгариш кўрдик. Компания билан ҳамкорликдан ҳурсандмиз.",
        "company_video_text4": "Ассалому алайкум, Виртус Триcот техтил аксессуарлари ишлаб чиқариш компанияси ҳисобланади. Сотув бўлими бошлиғиман исмим Ойгул. Компаниямиз 10 йилдан ошиқ муддатдан бери фаолият юритиб келади. Мен ўзим бу компанияда 2022-йилнинг бошидан мана шу компанияда фаолият юритиб келаман. Мен ушбу компанияга келганимдан бироз вақт ўтиб биз Бригҳт Cонсултинг Cомпанияси билан ҳамкорликни бошладик. Улар бизга cалл-cентре ни ташкиллаштириш ва ривожлантиришда , Сотув бўлимини ривожлантиришда, ижтимоий тармоқларда янги мижозларни жалб қилиш ва маркетинг стратегиясини ривожлантиришда яқиндан ёрдам беришди. Бригҳт Cонсултинг cомпанияси билан ҳамкорликда ишлаётганимиздан жуда ҳам ҳурсандмиз. Умид қиламизки бундан кейин ўзаро ҳамкорлигимиз сақланиб қолади.",
        "we_other_result_title": "Биз билан ишлаган мижозларимиз натижалари",

        "the_best_text1": "2021-йил энг яхши cонсултинг ҳизматлари бўйича 1-ўрин",
        "the_best_text2": "2022-йил энг яхши cонсултинг ҳизматлари бўйича 1-ўрин",
        "": "",
        "": "",
        "": "",
        "products_title": "Our products",
        "product_card_name": "STICK",
          "product_model_name": "model: SS034",
        "contact_phone1": "+998 (94) 481-77-81",
        "contact_phone2": "+998 (99) 752-77-75",
        "model": "model:",
        "Characteristics": "Characteristics:",
        "lifting_capasity_text": "Lifting capacity:",
        "boom_text": "Boom:",
        "": "",
        "": "",
        "": "",
      
  
    },
    "ru": {
      "about": "О нас",

        "home": "Главная страница",
        "projects": "Компании, которые мы обслуживали",
        "services": "Услуги",
        "contact": "Контакты",
        "clients": "Акции", 
        "products": "Продукты",
        "location": "г. Ташкент, Охонгара р.",
        "job_time": "Каждый день с 9:00 до 18:00",
        "powered_by": "©  2023 Powered by", 
        "job_time_title": "Режим работы",
        "social_title": "Социальные сети",

      "more": "подробнее...",
      "about_text": "«Компания Sekwang» гордится тем, что является одним из ведущих мировых творческих претендентов благодаря постоянному технологическому развитию и снижению затрат, а также обладает самым высоким уровнем глобальной конкурентоспособности своей продукции. Мы думаем с точки зрения клиента: «Навстречу бесконечным потребностям клиентов». Это наша политика: «Быть ​​признанными клиентами как их лучший поставщик!\»\
      \
      Мы стремимся создать счастье посредством кардинальных изменений и новых задач, а также предоставить вам более продвинутые услуги.\
      \
      Мы всегда ценим вашу поддержку и желаем вам удачи. Спасибо.",
      "we_result_title": "Компании, которые мы обслуживали",
        "lead_form_title1": "Оставьте нам свой номер и мы обязательно свяжемся с вами",
        "lead_form_title2": "Свяжитесь с нами сейчас, и мы вместе решим ваши бизнес-задачи!",
        "consultation_send_button": "отправлять",
        "telegram_message_modal_text": "Запрос успешно отправлен!",

        "result_card_text1": "Квалифицированный технический персонал",
        "result_card_text2": "Постоянное улучшение",
        "result_card_text3": "Удовлетворенность клиентов",
        "result_card_text4": "Идеально подходит для безопасной работы",
        "result_card_text5": "Сильная долговечность",
        "result_card_text6": "Устройства безопасности",
        "result_card_text7": "Простое операционное устройство",
        "result_card_text8": "Отличная грузоподъемность",
        "we_service_company_title": "Биз хизмат кўрсатган компаниялар",
        "what_we_title": "Почему с нашими кранами?",
        "we_service_company_title": "Компании, которые мы обслуживали",
        "what_we_card_text": "1. 6 ЛЕТ ОПЫТА НА РЫНКЕ УЗБЕКИСТАНА",
        "what_we_card_text2": "2. «ДАННЫЕ» ПОЛНАЯ ИНФОРМАЦИЯ О ПОТРЕБИТЕЛЕ, ПЛАТЕЖЕСКОСТИ, ПОТРЕБНОСТЯХ, ПРОБЛЕМАХ В УЗБЕКИСТАНЕ.",
        "what_we_card_text3": "3. СПЕЦИАЛИЗАЦИЯ В ОПРЕДЕЛЕННЫХ ОБЛАСТЯХ",
        "what_we_card_text4": "4. УЖЕ 2 ГОДА МЫ ЗАНИМАЕМСЯ ЛУЧШИМ КОНСАЛТИНГОВЫМ АГЕНТСТВОМ В СВОЕЙ ОБЛАСТИ",
        "what_we_card_text5": "5. 85% КЛИЕНТОВ ПОСТОЯННЫ",
        "what_we_card_text6": "6. НЕ ПРОВЕРЕННЫЕ УСЛУГИ (PERFORMANCE MARKETING) ДЕНЬГИ ОТ РЕЗУЛЬТАТА",
        "companys_thought_title": "Что наши клиенты говорят о нас",
        "company_name1": "\"ЗАМИН КУРИЛИШ\" строительная компания",
        "company_name2": "Ореховый сад",
        "company_name3": "ВЕРО строй рынок",
        "company_name4": "Виртус трикотаж",
        "company_video_text": "Здравствуйте, после тренингов, проведенных нашим маркетинговым партнером Bright Media, наши менеджеры по продажам показывают высокие результаты. Выражаем за это благодарность и думаем, что наше дальнейшее сотрудничество даст лучшие результаты.",
        "company_video_text2": "Здравствуйте, я с вами. Компания «Ореховый сад» начала сотрудничество с Bight Media. Наша компания очень рада сотрудничеству с Bright Media. Потому что мы верим, что наше сотрудничество достигнет еще более высоких высот. Спасибо Брайт Медиа. Результат отличный.",
        "company_video_text3": "Здравствуйте, меня зовут Ботр, я работаю менеджером Веро Строй Маркет. Наша компания работает с 2006 года. В настоящее время мы работаем в сотрудничестве с Bright Consulting. До сих пор компания помогала нам формировать учебный центр и развивать его, создавать CJM и разрабатывать маркетинговую стратегию, привлекая новые компании. Из-за этого мы наблюдаем значительные изменения в наших продажах. Мы рады сотрудничеству с компанией.",
        "company_video_text4": "Здравствуйте, Virtus Tricot — компания по производству текстильных аксессуаров. Меня зовут Айгуль, руководитель отдела продаж. Наша компания работает более 10 лет. Я сам работаю в этой компании с начала 2022 года. Через некоторое время после того, как я пришел в эту компанию, мы начали сотрудничество с Bright Consulting Company. Они тесно помогали нам в организации и развитии колл-центра, развитии отдела продаж, привлечении новых клиентов в социальных сетях и разработке маркетинговой стратегии. Мы очень гордимся сотрудничеством с Bright Consulting. Надеемся, что наше сотрудничество продолжится.",

        "we_other_result_title": "Результаты наших клиентов, с которыми мы работали",
        "result_company_name": "Веро Строй Маркет",
        "company_special": "Адрес компании: Строй Маркет",
        "service_period": "Срок сотрудничества: 6 месяцев",
        "company_growtt": "Темпы роста после партнерства: 17,4%",
        "the_best_title1": "В РЯД",
        "the_best_title2": "2 ГОДА",
        "the_best_title3": "В РЕСПУБЛИКАНСКОМ КОНКУРСЕ МЫ ПРИЗНАЛИ ДОСТОЙНЫЕ 1 МЕСТА В СВОЕЙ ОБЛАСТИ",

        "the_best_text1": "1 место в рейтинге лучших консалтинговых услуг 2021 года",
        "the_best_text2": "1 место в рейтинге лучших консалтинговых услуг 2022 года",
       
        "products_title": "Наши продукты",
      "product_card_name": "СТИCК",
        "product_model_name": "модел: SS034",
        // "product_model_name": "",
        // "product_model_name": "",
        // "product_model_name": "",
        // "product_model_name": "",
        "": "",
        "contact_phone1": "+998 (94) 481-77-81",
        "contact_phone2": "",
        "model": "модель:",
        "Characteristics": "Характеристики:",
        "lifting_capasity_text": "Грузоподъемность:",
        "boom_text": "Бум:",
        "": "",
        "": "",
        "": "",
        "": "",
        "": "",
        "": "",
        "": "",
        "": "",
        "": "",
        "": "",
        "": "",
        "": "",
        "": "",
        "": "",
        "": "",
        "": "",
        "": "",
        "": "",
        "": "",
        "": "",
        "": "",
        "": "",
        "": "",
        "": "",
        "": "",
        "": "",
        "": "",
        "": "",
        "": "",
        "": "",
        "": "",
        "": "",
        "": "",
        "": "",
        "": "",
        "": "",
        "": "",
        "": "",
        "": "",
        "": "",
        "": "",
    },
    "kr": {
      "home": "집",
      "about": "회사 소개",
      "services": "서비스",
      "contact": "연락하다",
      "products": "제품",
      "projects": "Биз ҳизмат кўрсатган компаниялар",
      "": "",
      "": "",
      "": "",
      "": "",
      "about_text": "\"세광컴퍼니\"는 끊임없는 기술개발과 원가절감을 통해 세계 최고 수준의 창의적 도전자이자 세계 최고 수준의 제품 경쟁력을 보유하고 있음을 자부합니다. 고객의 입장에서 생각합니다. \"고객의 끝없는 니즈를 향하여\" \"고객이 최고의 공급자로 인정받자!\"라는 것이 우리의 방침입니다.\
      \
      과감한 변화와 새로운 도전을 통해 행복을 창조하고, 개인적으로 더 발전된 서비스를 제공할 것을 약속드립니다.\
      \
      항상 귀하의 지원에 감사드리며 행운을 빕니다. 감사합니다.",
      
      "location": "Toshkent sh. Ohongaron yo'li",
      "job_time": "월요일~금요일 9:00~18:00 \
      토요일, 일요일 휴무",
      "powered_by": "©  2023 Powered by",
      "job_time_title": "Working time",
      "social_title": "Social network pages",

      "more": "더...",
      "we_service_company_title": "Биз хизмат кўрсатган компаниялар",
      "lead_form_title1": "전화번호를 남겨주시면 확인 후 연락드리겠습니다.",
      "lead_form_title2": "Ҳозироқ бизга мурожаат қилинг ва бизнесингиздаги муаммоларни биргаликда ҳал қиламиз!",
      "consultation_send_button": "보내다",
      "telegram_message_modal_text": "요청이 성공적으로 전송되었습니다!",

      "we_result_title": "Бизнинг натижаларимиз рақамларда:",
      "result_card_text1": "숙련된 기술 인력",
      "result_card_text2": "지속적인 개선",
      "result_card_text3": "고객 만족",
      "result_card_text4": "안전 작업에 적합",
      "result_card_text5": "강한 내구성",
      "result_card_text6": "안전장치",
      "result_card_text7": "쉬운 작동 장치",
      "result_card_text8": "우수한 리프팅 용량",
      "we_service_company_title": "Биз хизмат кўрсатган компаниялар",
      "what_we_title": "우리 크레인을 사용하는 이유는 무엇입니까?",
      
      "companys_thought_title": "Мижозларимиз биз ҳақимизда билдирган фикрлари",
      "company_name1": "ЗАМИН ҚУРИЛИШ cонстуcтион компанияси",
      "company_name2": "Ореҳовий сад",
      "company_name3": "ВЕРО строй маркет",
      "company_name4": "Виртус Триcот",
      "company_video_text": "Ассалому алайкум, бизнинг маркетинг ҳамкоримиз бўлган Бригҳт Медиа томонидан ўтказилган тренинг дарсларидан сўнг бизнинг сотув менеджерларимиз юқори натижалар кўрсотмоқда. Бунинг учун ўз миннатдорчилигимизни билдирамиз ва ўйлаймизки бундан кейинги ҳамкорлигимиз ҳам бундан яхши натижалар кўрсатади.",
      "company_video_text2": "Ассалому алайкум, сиз билан ореҳовий сад. Ореховий сад компанияси Бигҳт Медиа билан ҳамкорликни бошлади. Бизнинг компания Бригҳт Медиа билан ҳамкорлик қилишидан жуда мамнун. Чунки ҳамкорлигимиз бундан ҳам юқори чўққиларга чиқишига ишонамиз. Бригҳт Медиага раҳмат. Натижа жуда зўр.",
      "company_video_text3": "Ассалому алайкум, менинг исмим Ботр мен Веро Строй Маркет компаниясининг менеджери бўлиб ишлайман. Компаниямиз 2006-йилдан бери ўз фаолиятини юритиб келмоқда. Биз ҳозирги кунда Бригҳт Cонсултинг компанияси билан ҳамкорликда ишлаб келмоқдамиз. Ҳозирги кунгача компания бизга курс-cентер шакллантириб уни ривожлантиришда, CЖМ тузишда ва маркетинг стратегиясини ишлаб чиқишда, янги компанияларни жалб қилиб беришди. Шу сабабли сотувимизда сезиларли даражада ўзгариш кўрдик. Компания билан ҳамкорликдан ҳурсандмиз.",
      "company_video_text4": "Ассалому алайкум, Виртус Триcот техтил аксессуарлари ишлаб чиқариш компанияси ҳисобланади. Сотув бўлими бошлиғиман исмим Ойгул. Компаниямиз 10 йилдан ошиқ муддатдан бери фаолият юритиб келади. Мен ўзим бу компанияда 2022-йилнинг бошидан мана шу компанияда фаолият юритиб келаман. Мен ушбу компанияга келганимдан бироз вақт ўтиб биз Бригҳт Cонсултинг Cомпанияси билан ҳамкорликни бошладик. Улар бизга cалл-cентре ни ташкиллаштириш ва ривожлантиришда , Сотув бўлимини ривожлантиришда, ижтимоий тармоқларда янги мижозларни жалб қилиш ва маркетинг стратегиясини ривожлантиришда яқиндан ёрдам беришди. Бригҳт Cонсултинг cомпанияси билан ҳамкорликда ишлаётганимиздан жуда ҳам ҳурсандмиз. Умид қиламизки бундан кейин ўзаро ҳамкорлигимиз сақланиб қолади.",
      "we_other_result_title": "Биз билан ишлаган мижозларимиз натижалари",
      "result_company_name": "Веро Строй Маркет",
      "company_special": "Компания ёъналиши:  Строй Маркет",
      "service_period": "Ўзаро ҳамкорлик муддати:  6 ой",
      "company_growtt": "Ҳамкорликдан кейин ўсиш сурати:  17,4%",
      "the_best_title1": "ҚАТОРАСИГА",
      "the_best_title2": "2 ЙИЛ",
      "the_best_title3": "РЕСПУБЛИКА МИҚЁСИДА ЎТКАЗИЛГАН ТАНЛОВДА   СОХАМИЗ БЎЙИЧА 1-ЎРИНГА ЛОЙИҚ ДЕП ТОПИЛДИК",

      "the_best_text1": "2021-йил энг яхши cонсултинг ҳизматлари бўйича 1-ўрин",
      "the_best_text2": "2022-йил энг яхши cонсултинг ҳизматлари бўйича 1-ўрин",
      "model": "모델:",
      "Characteristics": "형질:",

      "": "",
      "": "",
      "products_title": "우리의 제품",
      "product_card_name": "STICK",
        "product_model_name": "model: SS034",
      "contact_phone1": "82-31-996-9226",
      "contact_phone2": "",
      "lifting_capasity_text": "드는 수용량:",
        "boom_text": "팔:",
      "": "",
      "": "",
      "": "",
      "": "",
      "": "",
      "": "",
      "": "",
    

  }
  };
  

  let selectedLanguage = localStorage.getItem('selectedLanguage') || 'en';

const langElements = document.querySelectorAll('.lang');
const langButtons = document.querySelectorAll('.lang-button');

function changeLanguage(language) {
  selectedLanguage = language;
  localStorage.setItem('selectedLanguage', selectedLanguage);

  langElements.forEach(el => {
      el.textContent = langData[selectedLanguage][el.getAttribute('key')];
  });

  langButtons.forEach(button => {
      if (button.getAttribute('data-lang') === selectedLanguage) {
          button.classList.add('active_lang');
      } else {
          button.classList.remove('active_lang');
      }
  });
}

langButtons.forEach(button => {
  button.addEventListener('click', () => changeLanguage(button.getAttribute('data-lang')));
});

changeLanguage(selectedLanguage);
